export enum ELEMENT_TYPE {
    '火' = '火',
    '水' = '水',
    '风' = '风',
    '土' = '土',
    '光' = '光',
    '暗' = '暗',
    '无' = '无',
}

export enum RACE_TYPE {
    '人类' = '人类',
    '兽人' = '兽人',
    '精灵' = '精灵',
    '矮人' = '矮人',
}

export enum GENDER_TYPE {
    '男' = '男',
    '女' = '女',
}

export enum RARITY_TYPE {
    '传说' = '传说',
    '一般' = '一般',
    '无名' = '无名',
}

export enum PERSONALITY_TYPE {
    '善' = '善',
    '中立' = '中立',
    '恶' = '恶',
}

export enum FATE_TYPE {
    '力' = '力',
    '智慧' = '智慧',
    '信仰心' = '信仰心',
    '生命力' = '生命力',
    '灵巧' = '灵巧',
    '敏捷' = '敏捷',
    '待补充' = '待补充',
}

export const COMMON_CLASS = ['战士', '盗贼', '僧侣', '法师', '骑士', '忍者'];

export const DISCIPLINE_TAGS_LIST = [
    'HP',
    'MP',
    'SP',
    '攻击力',
    '魔力',
    '神力',
    '防御力',
    '法术防御力',
    '抵抗',
    '会心',
    '探知',
    '陷阱解除',
    '陷阱回避',
    '行动速度',
    '命中',
    '回避',
    '毒耐性',
    '麻痹耐性',
    '气绝耐性',
    '睡眠耐性',
    '封技耐性',
    '封魔耐性',
    '混乱耐性',
    '魅惑耐性',
    '石化耐心',
    '即死耐性',
    '恐惧耐性',
    '暴击耐性',
];
